hpmicro/hpm_sdk/soc/HPM6700/HPM64A0/HPM64A0_svd.xml
        <register>
          <name>REF_MSG</name>
          <description>TTCAN: Reference Message REF_MSG</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_IDE</name>
              <description>REFerence message IDE bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_MSG</name>
              <description>REFerence message IDentifier.
If REF_IDE is
1 - REF_ID(28:0) is valid (extended ID)
0 - REF_ID(10:0) is valid (standard ID)
REF_ID is used in TTCAN mode to detect a reference message. This holds for time
slaves (reception) as well as for the time master (transmission). If the reference
message is detected and there are no errors, then the Sync_Mark of this frame will
become the Ref_Mark.
REF_ID(2:0) is not tested and therefore the appropriate register bits are forced to 0.
These bits are used for up to 8 potential time masters.
CAN-CTRL recognizes the reference message only by ID. The payload is not tested.
Additional note: A time master will transmit a reference message in the same way as a
normal frame. REF_ID is intended for detection of a successful transmission of a
reference message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG_CFG</name>
          <description>TTCAN: Trigger Configuration TRIG_CFG</description>
          <addressOffset>0xc4</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xF73F</resetMask>
          <fields>
            <field>
              <name>TEW</name>
              <description>Transmit Enable Window
For a single shot transmit trigger there is a time of up to 16 ticks of the cycle time
where the frame is allowed to start. TWE+1 defines the number of ticks.
TEW=0 is a valid setting and shortens the transmit enable window to 1 tick</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTYPE</name>
              <description>Trigger Type
000b - Immediate Trigger for immediate transmission
001b - Time Trigger for receive triggers
010b - Single Shot Transmit Trigger for exclusive time windows
011b - Transmit Start Trigger for merged arbitrating time windows
100b - Transmit Stop Trigger for merged arbitrating time windows
others - no action
The time of the trigger is defined by TT_TRIG. TTPTR selects the TB slot for the
transmit triggers. See Chapter 6.4 for more details.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTPTR</name>
              <description>Transmit Trigger TB slot Pointer
If TTPTR is too big and points to a slot that is not available, then TEIF is set and no
new trigger can be activated after a write access to TT_TRIG_1.
If TTPTR points to an empty slot, then TEIF will be set at the moment, when the
trigger time is reached.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TT_TRIG</name>
          <description>TTCAN: Trigger Time TT_TRIG</description>
          <addressOffset>0xc6</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TT_TRIG</name>
              <description>Trigger Time
TT_TRIG(15:0) defines the cycle time for a trigger.
For a transmission trigger theearliest point of transmission of the SOF of the appropriate frame will be TT_TRIG+1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TT_WTRIG</name>
          <description>TTCAN: Watch Trigger Time TT_WTRIG</description>
          <addressOffset>0xc8</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TT_WTRIG</name>
              <description>Watch Trigger Time
TT_WTRIG(15:0) defines the cycle time for a watch trigger. The initial watch trigger isthe maximum cycle time 0xffff.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <description>CAN1</description>
      <groupName>CAN</groupName>
      <baseAddress>0xf0084000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN2</name>
      <description>CAN2</description>
      <groupName>CAN</groupName>
      <baseAddress>0xf0088000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN3</name>
      <description>CAN3</description>
      <groupName>CAN</groupName>
      <baseAddress>0xf008c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>WDG0</name>
      <description>WDG0</description>
      <groupName>WDOG</groupName>
      <baseAddress>0xf0090000</baseAddress>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RSTTIME</name>
              <description>The time interval of the reset stage:
0: Clock period x 2^7
1: Clock period x 2^8
2: Clock period x 2^9
3: Clock period x 2^10
4: Clock period x 2^11
5: Clock period x 2^12
6: Clock period x 2^13
7: Clock period x 2^14</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTTIME</name>
              <description>The timer interval of the interrupt stage:
0: Clock period x 2^6
1: Clock period x 2^8
2: Clock period x 2^10
3: Clock period x 2^11
4: Clock period x 2^12
5: Clock period x 2^13
6: Clock period x 2^14
7: Clock period x 2^15
8: Clock period x 2^17
9: Clock period x 2^19
10: Clock period x 2^21
11: Clock period x 2^23
12: Clock period x 2^25
13: Clock period x 2^27
14: Clock period x 2^29
15: Clock period x 2^31</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTEN</name>
              <description>Enable or disable the watchdog reset
0: Disable
1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEN</name>
              <description>Enable or disable the watchdog interrupt
0: Disable
1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock source of timer:
0: EXTCLK
1: PCLK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable or disable the watchdog timer
0: Disable
1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Restart</name>
          <description>Restart Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RESTART</name>
              <description>Write the magic number
ATCWDT200_RESTART_NUM to restart the
watchdog timer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WrEn</name>
          <description>Write Protection Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>WEN</name>
              <description>Write the magic code to disable the write
protection of the Control Register and the
Restart Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>St</name>
          <description>Status Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>INTEXPIRED</name>
              <description>The status of the watchdog interrupt timer
0: timer is not expired yet
1: timer is expired</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
