hpmicro/hpm_sdk/soc/HPM6700/HPM64A0/HPM64A0_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAM0">
      <name>CAM1</name>
      <description>CAM1</description>
      <groupName>CAM</groupName>
      <baseAddress>0xf100c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PDMA</name>
      <description>PDMA</description>
      <groupName>PDMA</groupName>
      <baseAddress>0xf1010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xc0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARQOS</name>
              <description>QoS for AXI read bus</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWQOS</name>
              <description>QoS for AXI write bus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PACK_DIR</name>
              <description>Decide the byte sequence of the 32-bit output word {A3, A2, A1, A0}. The bit sequence ina byte is not changed.
2'b00: no change {A3, A2, A1, A0}
2'b01: {A2, A3, A0, A1}
2'b10: {A1, A0, A3, A2}
2'b11: {A0, A1, A2, A3}</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIERR_IRQ_EN</name>
              <description>Enable interrupt of AXI bus error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_DONE_IRQ_EN</name>
              <description>Enable interrupt of PDMA_DONE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>Assert this bit to gate off clock when the module is not working. If reset to zero, the internal clock is always on.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_EN</name>
              <description>Enable normal interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS16</name>
              <description>Asserted when the Block Size is 16x16, else 8x8</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_EN</name>
              <description>Plane 1 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_EN</name>
              <description>Plane 0 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_SFTRST</name>
              <description>Software Reset.
Write 1 to clear PDMA internal logic.
Write 0 to exit software reset mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_EN</name>
              <description>1b - Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLOCKY</name>
              <description>Y block that is processing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLOCKX</name>
              <description>X block that is processing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMA_DONE</name>
              <description>PDMA one image done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXI_ERR_ID</name>
              <description>AXI error ID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_0_WRITE_ERR</name>
              <description>AXI0 write err</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXI_1_READ_ERR</name>
              <description>AXI1 read err</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXI_0_READ_ERR</name>
              <description>AXI0 read err</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRQ</name>
              <description>Asserted to indicate a IRQ event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CTRL</name>
          <description>Out Layer Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF3F</resetMask>
          <fields>
            <field>
              <name>DSTALPHA</name>
              <description>The destination (P1) system ALPHA value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCALPHA</name>
              <description>The source (P0) system ALPHA value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTALPHA_OP</name>
              <description>The usage of the DSTALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel embedded in the stream indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
0: the DSTALPHA[7:0] is invalid, use the alpha value embedded in the stream
1: the DSTALPHA[7:0] is used to override the alpha value embedded in the stream.  (useful when the corresponding data stream has no alpha info)
2: the DSTALPHA[7:0] is used to scale the alpha value embedded in the stream
Others: Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCALPHA_OP</name>
              <description>The usage of the SRCALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel embedded in the stream indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
0: the SRCALPHA[7:0] is invalid, use the alpha value embedded in the stream
1: the SRCALPHA[7:0] is used to override the alpha value embedded in the stream .  (useful when the corresponding data stream has no alpha info)
2: the SRCALPHA[7:0] is used to scale the alpha value embedded in the stream
Others: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABLEND_MODE</name>
              <description>Alpha Blending Mode
0: SKBlendMode_Clear (If PS1_CTRL[BKGNDCL4CLR] is asserted, use PS1_BKGRND color to fill the range determined by PS1, else fill the range determined by PS1 with zero);
1: SKBlendMode_Src ;
2: SKBlendMode_Dst
3: SKBlendMode_SrcOver
4: SKBlendMode_DstOver
5: SKBlendMode_SrcIn
6: SKBlendMode_DstIn
7: SKBlendMode_SrcOut
8: SKBlendMode_DstOut
9: SKBlendMode_SrcATop
10: SKBlendMode_DstATop
11: SKBlendMode_Xor
12: SKBlendMode_Plus    (The conventional belding mode)
13: SKBlendMode_Modulate
14: SRC org
15: DST org
Others: Reserved.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Output buffer format.
0x0 ARGB8888 - 32-bit pixles, byte sequence as B,G,R,A
0xE RGB565 - 16-bit pixels, byte sequence as B,R
0x12 UYVY1P422 - 16-bit pixels (1-plane , byte sequence as U0,Y0,V0,Y1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF</name>
          <description>Output buffer address</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Current address pointer for the output frame buffer. The address can have any byte alignment. 64B alignment is recommended for optimal performance.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PITCH</name>
          <description>Outlayer Pitch Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>BYTELEN</name>
              <description>Indicates the number of bytes in memory between two vertically adjacent pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LRC</name>
          <description>Output Lower Right Corner Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>This field indicates the lower right Y-coordinate (in pixels) of the output frame buffer.
The value is the height of the output image size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>This field indicates the lower right X-coordinate (in pixels) of the output frame buffer.
Should be the width of the output image size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>OUT_PS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x1c</addressOffset>
          <register>
            <name>ULC</name>
            <description>Layer Upper Left Corner Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFF3FFF</resetMask>
            <fields>
              <field>
                <name>Y</name>
                <description>This field indicates the upper left Y-coordinate (in pixels) of the processed surface in the output frame buffer.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>X</name>
                <description>This field indicates the upper left X-coordinate (in pixels) of the processed surface in the output frame buffer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LRC</name>
            <description>Layer Lower Right Corner Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFF3FFF</resetMask>
            <fields>
              <field>
                <name>Y</name>
                <description>This field indicates the lower right Y-coordinate (in pixels) of the processed surface in the output frame buffer.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>X</name>
                <description>This field indicates the lower right X-coordinate (in pixels) of the processed surface in the output frame buffer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x30</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>PS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x30</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Layer Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x001FFFFF</resetMask>
            <fields>
              <field>
                <name>INB13_SWAP</name>
                <description>Swap bit[31:24] and bit [15:8] before pack_dir operation.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PACK_DIR</name>
                <description>Decide the byte sequence of the 32-bit word {A3, A2, A1, A0}. The bit sequence ina byte is not changed.
2'b00: no change {A3, A2, A1, A0}
2'b01: {A2, A3, A0, A1}
2'b10: {A1, A0, A3, A2}
2'b11: {A0, A1, A2, A3}</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BKGCL4CLR</name>
                <description>Enable to use background color for clear area</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>YCBCR_MODE</name>
                <description>YCbCr mode or YUV mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BYPASS</name>
                <description>Asserted to bypass the CSC stage</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VFLIP</name>
                <description>Indicates that the input should be flipped vertically (effect applied before rotation).</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HFLIP</name>
                <description>Indicates that the input should be flipped horizontally (effect applied before rotation).</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ROTATE</name>
                <description>Indicates the clockwise rotation to be applied at the input buffer. The rotation effect is defined as occurring
after the FLIP_X and FLIP_Y permutation.
0x0 ROT_0
0x1 ROT_90
0x2 ROT_180
0x3 ROT_270</description>
                <bitOffset>11</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DECY</name>
                <description>Verticle pre decimation filter control.
0x0 DISABLE - Disable pre-decimation filter.
0x1 DECY2  - Decimate PS by 2.
0x2 DECY4 - Decimate PS by 4.
0x3 DECY8 - Decimate PS by 8.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DECX</name>
                <description>Horizontal pre decimation filter control.
0x0 DISABLE - Disable pre-decimation filter.
0x1 DECX2 - Decimate PS by 2.
0x2 DECX4 - Decimate PS by 4.
0x3 DECX8 - Decimate PS by 8.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HW_BYTE_SWAP</name>
                <description>Swap bytes in half-words. For each 16 bit half-word, the two bytes will be swapped.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORMAT</name>
                <description>PS buffer format. To select between YUV and YCbCr formats, see bit 16 of this register.
0x0 ARGB888 - 32-bit pixels, byte sequence as B,G,R,A
0xE RGB565 - 16-bit pixels, byte sequence as B,R
0x13 YUYV1P422 - 16-bit pixels (1-plane byte sequence Y0,U0,Y1,V0 interleaved bytes)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BUF</name>
            <description>Layer data buffer address</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address pointer for the PS RGB or Y (luma) input buffer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PITCH</name>
            <description>Layer data pitch register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>BYTELEN</name>
                <description>Indicates the number of bytes in memory between two vertically adjacent pixels.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BKGD</name>
            <description>Layer background color register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COLOR</name>
                <description>Background color (in 32bpp format) for any pixels not within the scaled range of the picture, but within the buffer range specified by the PS ULC/LRC. The top 8-bit is the alpha channel.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
