hpmicro/hpm_sdk/soc/HPM6700/HPM64A0/HPM64A0_svd.xml
        <register>
          <name>PSTATE</name>
          <description>No description available</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x19FF0FFF</resetMask>
          <fields>
            <field>
              <name>SUB_CMD_STAT</name>
              <description>Sub Command Status
This bit is used to distinguish between a main command and a sub command status.
Values:
0x0 (FALSE): Main Command Status
0x1 (TRUE): Sub Command Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_ISSUE_ERR</name>
              <description>Command Not Issued by Error
This bit is set if a command cannot be issued after setting the command register due to an error except the Auto CMD12 error.
Values:
0x0 (FALSE): No error for issuing a command
0x1 (TRUE): Command cannot be issued</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_LINE_LVL</name>
              <description>Command-Line Signal Level
This bit is used to check the CMD line level to recover from errors and for debugging. These bits reflect the value of the sd_cmd_in signal.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT_3_0</name>
              <description>DAT[3:0] Line Signal Level
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (lower nibble) signal.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PROTECT_SW_LVL</name>
              <description>Write Protect Switch Pin Level
This bit is supported only for memory and combo cards. This bit reflects the synchronized value of the card_write_prot signal.
Values:
0x0 (FALSE): Write protected
0x1 (TRUE): Write enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARD_DETECT_PIN_LEVEL</name>
              <description>Card Detect Pin Level
This bit reflects the inverse synchronized value of the card_detect_n signal.
Values:
0x0 (FALSE): No card present
0x1 (TRUE): Card Present</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARD_STABLE</name>
              <description>Card Stable
This bit indicates the stability of the Card Detect Pin Level. A card is not detected if this bit is set to 1 and the value of the CARD_INSERTED bit is 0.
Values:
0x0 (FALSE): Reset or Debouncing
0x1 (TRUE): No Card or Inserted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARD_INSERTED</name>
              <description>Card Inserted
This bit indicates whether a card has been inserted. The Host Controller debounces this signal so that Host Driver need not wait for it to stabilize.
Values:
0x0 (FALSE): Reset, Debouncing, or No card
0x1 (TRUE): Card Inserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUF_RD_ENABLE</name>
              <description>Buffer Read Enable
This bit is used for non-DMA transfers. This bit is set if valid data exists in the Host buffer.
Values:
0x0 (DISABLED): Read disable
0x1 (ENABLED): Read enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUF_WR_ENABLE</name>
              <description>Buffer Write Enable
This bit is used for non-DMA transfers. This bit is set if space is available for writing data.
Values:
0x0 (DISABLED): Write disable
0x1 (ENABLED): Write enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_XFER_ACTIVE</name>
              <description>Read Transfer Active
This bit indicates whether a read transfer is active for SD/eMMC mode.
Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_XFER_ACTIVE</name>
              <description>Write Transfer Active
This status indicates whether a write transfer is active for SD/eMMC mode.
Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT_7_4</name>
              <description>DAT[7:4] Line Signal Level
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (upper nibble) signal.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RE_TUNE_REQ</name>
              <description>Re-Tuning Request
SDXC does not generate retuning request. The software must maintain the Retuning timer.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT_LINE_ACTIVE</name>
              <description>DAT Line Active (
This bit indicates whether one of the DAT lines on the SD/eMMC bus is in use.
In the case of read transactions, this bit indicates whether a read transfer is executing on the SD/eMMC bus.
In the case of write transactions, this bit indicates whether a write transfer is executing on the SD/eMMC bus.
For a command with busy, this status indicates whether the command executing busy is executing on an SD or eMMC bus.
Values:
0x0 (INACTIVE): DAT Line Inactive
0x1 (ACTIVE): DAT Line Active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT_INHIBIT</name>
              <description>Command Inhibit (DAT)
This bit is generated if either DAT line active or Read transfer active is set to 1.
If this bit is set to 0, it indicates that the Host Controller can issue subsequent SD/eMMC commands.
Values:
0x0 (READY): Can issue command which used DAT line
0x1 (NOT_READY): Cannot issue command which used DAT line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_INHIBIT</name>
              <description>Command Inhibit (CMD)
This bit indicates the following :
If this bit is set to 0, it indicates that the CMD line is not in use and the Host controller can issue an SD/eMMC command using the CMD line.
This bit is set when the command register is written. This bit is cleared when the command response is received.
This bit is not cleared by the response of auto CMD12/23 but cleared by the response of read/write command.
Values:
0x0 (READY): Host Controller is ready to issue a command
0x1 (NOT_READY): Host Controller is not ready to issue a command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_CTRL</name>
          <description>No description available</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x070F0F3E</resetMask>
          <fields>
            <field>
              <name>CARD_REMOVAL</name>
              <description>Wakeup Event Enable on SD Card Removal
This bit enables wakeup event through Card Removal assertion in the Normal Interrupt Status register.
For the SDIO card, Wake Up Support (FN_WUS) in the Card Information Structure (CIS) register does not affect this bit.
Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARD_INSERT</name>
              <description>Wakeup Event Enable on SD Card Insertion
This bit enables wakeup event through Card Insertion assertion in the Normal Interrupt Status register.
FN_WUS (Wake Up Support) in CIS does not affect this bit.
Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARD_INT</name>
              <description>Wakeup Event Enable on Card Interrupt
This bit enables wakeup event through a Card Interrupt assertion in the Normal Interrupt Status register.
This bit can be set to 1 if FN_WUS (Wake Up Support) in CIS is set to 1.
Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_AT_BGAP</name>
              <description>Interrupt At Block Gap
This bit is valid only in the 4-bit mode of an SDIO card and is used to select a sample point in the interrupt cycle.
Setting to 1 enables interrupt detection at the block gap for a multiple block transfer.
Values:
0x0 (DISABLE): Disabled
0x1 (ENABLE): Enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_WAIT_CTRL</name>
              <description>Read Wait Control
This bit is used to enable the read wait protocol to stop read data using DAT[2] line if the card supports read wait.
Otherwise, the Host Controller has to stop the card clock to hold the read data. In UHS-II mode, Read Wait is disabled.
Values:
0x0 (DISABLE): Disable Read Wait Control
0x1 (ENABLE): Enable Read Wait Control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONTINUE_REQ</name>
              <description>Continue Request
This bit is used to restart the transaction, which was stopped using the Stop At Block Gap Request.
The Host Controller automatically clears this bit when the transaction restarts.
If stop at block gap request is set to 1, any write to this bit is ignored.
Values:
0x0 (NO_AFFECT): No Affect
0x1 (RESTART): Restart</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_BG_REQ</name>
              <description>Stop At Block Gap Request
This bit is used to stop executing read and write transactions at the next block gap for non-DMA, SDMA, and ADMA transfers.
Values:
0x0 (XFER): Transfer
0x1 (STOP): Stop</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_BUS_VOL_VDD1</name>
              <description>SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD
These bits enable the Host Driver to select the voltage level for an SD/eMMC card.
Before setting this register, the Host Driver checks the Voltage Support bits in the Capabilities register.
If an unsupported voltage is selected, the Host System does not supply the SD Bus voltage.
The value set in this field is available on the SDXC output signal (sd_vdd1_sel), which is used by the voltage switching circuitry.
SD Bus Voltage Select options:
0x7 : 3.3V(Typical)
0x6 : 3.0V(Typical)
0x5 : 1.8V(Typical) for Embedded
0x4 : 0x0 - Reserved
eMMC Bus Voltage Select options:
0x7 : 3.3V(Typical)
0x6 : 1.8V(Typical)
0x5 : 1.2V(Typical)
0x4 : 0x0 - Reserved
Values:
0x7 (V_3_3): 3.3V (Typ.)
0x6 (V_3_0): 3.0V (Typ.)
0x5 (V_1_8): 1.8V (Typ.) for Embedded
0x4 (RSVD4): Reserved
0x3 (RSVD3): Reserved
0x2 (RSVD2): Reserved
0x1 (RSVD1): Reserved
0x0 (RSVD0): Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_BUS_PWR_VDD1</name>
              <description>SD Bus Power for VDD1
This bit enables VDD1 power of the card.
This setting is available on the sd_vdd1_on output of SDXC so that it can be used to control the VDD1 power supply of the card.
Before setting this bit, the SD Host Driver sets the SD Bus Voltage Select bit. If the Host Controller detects a No Card state, this bit is cleared.
In SD mode, if this bit is cleared, the Host Controller stops the SD Clock by clearing the SD_CLK_EN bit in the SYS_CTRL register.
Values:
0x0 (OFF): Power off
0x1 (ON): Power on</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_DAT_XFER</name>
              <description>Extended Data Transfer Width
This bit controls 8-bit bus width mode of embedded device.
Values:
0x1 (EIGHT_BIT): 8-bit Bus Width
0x0 (DEFAULT): Bus Width is selected by the Data Transfer Width</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_SEL</name>
              <description>DMA Select
This field is used to select the DMA type.
When Host Version 4 Enable is 1 in Host Control 2 register:
0x0 : SDMA is selected
0x1 : Reserved
0x2 : ADMA2 is selected
0x3 : ADMA2 or ADMA3 is selected
When Host Version 4 Enable is 0 in Host Control 2 register:
0x0 : SDMA is selected
0x1 : Reserved
0x2 : 32-bit Address ADMA2 is selected
0x3 : 64-bit Address ADMA2 is selected
Values:
0x0 (SDMA): SDMA is selected
0x1 (RSVD_BIT): Reserved
0x2 (ADMA2): ADMA2 is selected
0x3 (ADMA2_3): ADMA2 or ADMA3 is selected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGH_SPEED_EN</name>
              <description>High Speed Enable
this bit is used to determine the selection of preset value for High Speed mode.
Before setting this bit, the Host Driver checks the High Speed Support in the Capabilities register.
Note: SDXC always outputs the sd_cmd_out and sd_dat_out lines at the rising edge of cclk_tx clock irrespective of this bit.
Values:
0x1 (HIGH_SPEED): High Speed mode
0x0 (NORMAL_SPEED): Normal Speed mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT_XFER_WIDTH</name>
              <description>Data Transfer Width
For SD/eMMC mode,this bit selects the data transfer width of the Host Controller.
The Host Driver sets it to match the data width of the SD/eMMC card. In UHS-II mode, this bit is irrelevant.
Values:
0x1 (FOUR_BIT): 4-bit mode
0x0 (ONE_BIT): 1-bit mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
