hpmicro/hpm_sdk/soc/HPM6700/HPM64A0/HPM64A0_svd.xml
        <register>
          <name>SYS_CTRL</name>
          <description>No description available</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x070FFFEF</resetMask>
          <fields>
            <field>
              <name>SW_RST_DAT</name>
              <description>Software Reset For DAT line
This bit is used in SD/eMMC mode and it resets only a part of the data circuit and the DMA circuit is also reset.
The following registers and bits are cleared by this bit:
Buffer Data Port register
-Buffer is cleared and initialized.
Present state register
-Buffer Read Enable
-Buffer Write Enable
-Read Transfer Active
-Write Transfer Active
-DAT Line Active
-Command Inhibit (DAT)
Block Gap Control register
-Continue Request
-Stop At Block Gap Request
Normal Interrupt status register
-Buffer Read Ready
-Buffer Write Ready
-DMA Interrupt
-Block Gap Event
-Transfer Complete
In UHS-II mode, this bit shall be set to 0
Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RST_CMD</name>
              <description>Software Reset For CMD line
This bit resets only a part of the command circuit to be able to issue a command.
It bit is also used to initialize a UHS-II command circuit.
This reset is effective only for a command issuing circuit (including response error statuses related to Command Inhibit (CMD) control) and does not affect the data transfer circuit.
Host Controller can continue data transfer even after this reset is executed while handling subcommand-response errors.
The following registers and bits are cleared by this bit:
Present State register : Command Inhibit (CMD) bit
Normal Interrupt Status register : Command Complete bit
Error Interrupt Status : Response error statuses related to Command Inhibit (CMD) bit
Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RST_ALL</name>
              <description>Software Reset For All
This reset affects the entire Host Controller except for the card detection circuit.
During its initialization, the Host Driver sets this bit to 1 to reset the Host Controller.
All registers are reset except the capabilities register.
If this bit is set to 1, the Host Driver must issue reset command and reinitialize the card.
Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT_CNT</name>
              <description>Data Timeout Counter Value.
This value determines the interval by which DAT line timeouts are detected.
The Timeout clock frequency is generated by dividing the base clock TMCLK value by this value.
When setting this register, prevent inadvertent timeout events by clearing the Data Timeout Error Status Enable (in the Error Interrupt Status Enable register).
The values for these bits are:
0xF : Reserved
0xE : TMCLK x 2^27
.........
0x1 : TMCLK x 2^14
0x0 : TMCLK x 2^13
Note: During a boot operating in an eMMC mode, an application must configure the boot data timeout value (approximately 1 sec) in this bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_SEL</name>
              <description>SDCLK/RCLK Frequency Select
These bits are used to select the frequency of the SDCLK signal.
These bits depend on setting of Preset Value Enable in the Host Control 2 register.
If Preset Value Enable = 0, these bits are set by the Host Driver.
If Preset Value Enable = 1, these bits are automatically set to a value specified in one of the Preset Value register.
The value is reflected on the lower 8-bit of the card_clk_freq_selsignal.
10-bit Divided Clock Mode:
0x3FF : 1/2046 Divided clock
..........
N : 1/2N Divided Clock
..........
0x002 : 1/4 Divided Clock
0x001 : 1/2 Divided Clock
0x000 : Base clock (10MHz - 255 MHz)
Programmable Clock Mode : Enables the Host System to select a fine grain SD clock frequency:
0x3FF : Base clock * M /1024
..........
N-1 : Base clock * M /N
..........
0x002 : Base clock * M /3
0x001 : Base clock * M /2
0x000 : Base clock * M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPPER_FREQ_SEL</name>
              <description>These bits specify the upper 2 bits of 10-bit SDCLK/RCLK Frequency Select control.
The value is reflected on the upper 2 bits of the card_clk_freq_sel signal.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_GEN_SELECT</name>
              <description>Clock Generator Select
This bit is used to select the clock generator mode in SDCLK/RCLK Frequency Select.
If Preset Value Enable = 0, this bit is set by the Host Driver.
If Preset Value Enable = 1, this bit is automatically set to a value specified in one of the Preset Value registers.
The value is reflected on the card_clk_gen_sel signal.
Values:
0x0 (FALSE): Divided Clock Mode
0x1 (TRUE): Programmable Clock Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>PLL Enable
This bit is used to activate the PLL (applicable when Host Version 4 Enable = 1).
When Host Version 4 Enable = 0, INTERNAL_CLK_EN bit may be used to activate PLL. The value is reflected on the card_clk_en signal.
Note: If this bit is not used to to active the PLL when Host Version 4 Enable = 1, it is recommended to set this bit to '1' .
Values:
0x0 (FALSE): PLL is in low power mode
0x1 (TRUE): PLL is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_CLK_EN</name>
              <description>SD/eMMC Clock Enable
This bit stops the SDCLK or RCLK when set to 0.
The SDCLK/RCLK Frequency Select bit can be changed when this bit is set to 0.
The value is reflected on the clk2card_on pin.
Values:
0x0 (FALSE): Disable providing SDCLK/RCLK
0x1 (TRUE): Enable providing SDCLK/RCLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_CLK_STABLE</name>
              <description>Internal Clock Stable
This bit enables the Host Driver to check the clock stability twice after the Internal Clock Enable bit is set and after the PLL Enable bit is set.
This bit reflects the synchronized value of the intclk_stable signal after the Internal Clock Enable bit is set to 1,
and also reflects the synchronized value of the card_clk_stable signal after the PLL Enable bit is set to 1.
Values:
0x0 (FALSE): Not Ready
0x1 (TRUE): Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_CLK_EN</name>
              <description>Internal Clock Enable
This bit is set to 0 when the Host Driver is not using the Host Controller or the Host Controller awaits a wakeup interrupt.
The Host Controller must stop its internal clock to enter a very low power state.
However, registers can still be read and written to. The value is reflected on the intclk_en signal.
Note: If this bit is not used to control the internal clock (base clock and master clock), it is recommended to set this bit to '1' .
Values:
0x0 (FALSE): Stop
0x1 (TRUE): Oscillate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STAT</name>
          <description>No description available</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFF1FF</resetMask>
          <fields>
            <field>
              <name>BOOT_ACK_ERR</name>
              <description>Boot Acknowledgment Error
This bit is set when there is a timeout for boot acknowledgement or when detecting boot ack status having a value other than 010. This is applicable only when boot acknowledgement is expected in eMMC mode.
In SD/UHS-II mode, this bit is irrelevant.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ERR</name>
              <description>Response Error
Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver during DMA execution.
If Response Error Check Enable is set to 1 in the Transfer Mode register, Host Controller Checks R1 or R5 response. If an error is detected in a response, this bit is set to 1.This is applicable in SD/eMMC mode.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_ERR</name>
              <description>Tuning Error
This bit is set when an unrecoverable error is detected in a tuning circuit except during the tuning procedure
(occurrence of an error during tuning procedure is indicated by Sampling Clock Select in the Host Control 2 register).
By detecting Tuning Error, Host Driver needs to abort a command executing and perform tuning.
To reset tuning circuit, Sampling Clock Select is set to 0 before executing tuning procedure.
The Tuning Error is higher priority than the other error interrupts generated during data transfer.
By detecting Tuning Error, the Host Driver must discard data transferred by a current read/write command and retry data transfer after the Host Controller retrieved from the tuning circuit error.
This is applicable in SD/eMMC mode.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADMA_ERR</name>
              <description>ADMA Error
This bit is set when the Host Controller detects error during ADMA-based data transfer. The error could be due to following reasons:
Error response received from System bus (Master I/F)
ADMA3,ADMA2 Descriptors invalid
CQE Task or Transfer descriptors invalid
When the error occurs, the state of the ADMA is saved in the ADMA Error Status register.
In eMMC CQE mode:
The Host Controller generates this Interrupt when it detects an invalid descriptor data (Valid=0) at the ST_FDS state.
ADMA Error State in the ADMA Error Status indicates that an error has occurred in ST_FDS state.
The Host Driver may find that Valid bit is not set at the error descriptor.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTO_CMD_ERR</name>
              <description>Auto CMD Error
This error status is used by Auto CMD12 and Auto CMD23 in SD/eMMC mode.
This bit is set when detecting that any of the bits D00 to D05 in Auto CMD Error Status register has changed from 0 to 1.
D07 is effective in case of Auto CMD12. Auto CMD Error Status register is valid while this bit is set to 1 and may be cleared by clearing of this bit.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_LMT_ERR</name>
              <description>Current Limit Error
By setting the SD Bus Power bit in the Power Control register, the Host Controller is requested to supply power for the SD Bus.
If the Host Controller supports the Current Limit function, it can be protected from an illegal card by stopping power supply to the card in which case this bit indicates a failure status.
A reading of 1 for this bit means that the Host Controller is not supplying power to the SD card due to some failure.
A reading of 0 for this bit means that the Host Controller is supplying power and no error has occurred.
The Host Controller may require some sampling time to detect the current limit.
SDXC Host Controller does not support this function, this bit is always set to 0.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Power Fail</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_END_BIT_ERR</name>
              <description>Data End Bit Error
This error occurs in SD/eMMC mode either when detecting 0 at the end bit position of read data that uses the DAT line or at the end bit position of the CRC status.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_CRC_ERR</name>
              <description>Data CRC Error
This error occurs in SD/eMMC mode when detecting CRC error when transferring read data which uses the DAT line,
when detecting the Write CRC status having a value of other than 010 or when write CRC status timeout.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_TOUT_ERR</name>
              <description>Data Timeout Error
This bit is set in SD/eMMC mode when detecting one of the following timeout conditions:
Busy timeout for R1b, R5b type
Busy timeout after Write CRC status
Write CRC Status timeout
Read Data timeout
Values:
0x0 (FALSE): No error
0x1 (TRUE): Time out</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_IDX_ERR</name>
              <description>Command Index Error
This bit is set if a Command Index error occurs in the command respons in SD/eMMC mode.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_END_BIT_ERR</name>
              <description>Command End Bit Error
This bit is set when detecting that the end bit of a command response is 0 in SD/eMMC mode.
Values:
0x0 (FALSE): No error
0x1 (TRUE): End Bit error generated</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_CRC_ERR</name>
              <description>Command CRC Error
Command CRC Error is generated in SD/eMMC mode for following two cases.
If a response is returned and the Command Timeout Error is set to 0 (indicating no timeout), this bit is set to 1 when detecting a CRC error in the command response.
The Host Controller detects a CMD line conflict by monitoring the CMD line when a command is issued.
If the Host Controller drives the CMD line to 1 level,
but detects 0 level on the CMD line at the next SD clock edge, then the Host Controller aborts the command (stop driving CMD line) and set this bit to 1.
The Command Timeout Error is also set to 1 to distinguish a CMD line conflict.
Values:
0x0 (FALSE): No error
0x1 (TRUE): CRC error generated</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_TOUT_ERR</name>
              <description>Command Timeout Error
In SD/eMMC Mode,this bit is set only if no response is returned within 64 SD clock cycles from the end bit of the command.
If the Host Controller detects a CMD line conflict, along with Command CRC Error bit, this bit is set to 1, without waiting for 64 SD/eMMC card clock cycles.
Values:
0x0 (FALSE): No error
0x1 (TRUE): Time out</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_INTERRUPT</name>
              <description>Error Interrupt
If any of the bits in the Error Interrupt Status register are set, then this bit is set.
Values:
0x0 (FALSE): No Error
0x1 (TRUE): Error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CQE_EVENT</name>
              <description>Command Queuing Event
This status is set if Command Queuing/Crypto related event has occurred in eMMC/SD mode. Read CQHCI's CQIS/CRNQIS register for more details.
Values:
0x0 (FALSE): No Event
0x1 (TRUE): Command Queuing Event is detected</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FX_EVENT</name>
              <description>FX Event
This status is set when R[14] of response register is set to 1 and Response Type R1/R5 is set to 0 in Transfer Mode register. This interrupt is used with response check function.
Values:
0x0 (FALSE): No Event
0x1 (TRUE): FX Event is detected</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RE_TUNE_EVENT</name>
              <description>Re-tuning Event
This bit is set if the Re-Tuning Request changes from 0 to 1. Re-Tuning request is not supported.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARD_INTERRUPT</name>
              <description>Card Interrupt
This bit reflects the synchronized value of:
DAT[1] Interrupt Input for SD Mode
DAT[2] Interrupt Input for UHS-II Mode
Values:
0x0 (FALSE): No Card Interrupt
0x1 (TRUE): Generate Card Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARD_REMOVAL</name>
              <description>Card Removal
This bit is set if the Card Inserted in the Present State register changes from 1 to 0.
Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Removed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARD_INSERTION</name>
              <description>Card Insertion
This bit is set if the Card Inserted in the Present State register changes from 0 to 1.
Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Inserted</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_RD_READY</name>
              <description>Buffer Read Ready
This bit is set if the Buffer Read Enable changes from 0 to 1.
Values:
0x0 (FALSE): Not ready to read buffer
0x1 (TRUE): Ready to read buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_WR_READY</name>
              <description>Buffer Write Ready
This bit is set if the Buffer Write Enable changes from 0 to 1.
Values:
0x0 (FALSE): Not ready to write buffer
0x1 (TRUE): Ready to write buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_INTERRUPT</name>
              <description>DMA Interrupt
This bit is set if the Host Controller detects the SDMA Buffer Boundary during transfer.
In case of ADMA, by setting the Int field in the descriptor table, the Host controller generates this interrupt.
This interrupt is not generated after a Transfer Complete.
Values:
0x0 (FALSE): No DMA Interrupt
0x1 (TRUE): DMA Interrupt is generated</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGAP_EVENT</name>
              <description>Block Gap Event
This bit is set when both read/write transaction is stopped at block gap due to a Stop at Block Gap Request.
Values:
0x0 (FALSE): No Block Gap Event
0x1 (TRUE): Transaction stopped at block gap</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XFER_COMPLETE</name>
              <description>Transfer Complete
This bit is set when a read/write transfer and a command with status busy is completed.
Values:
0x0 (FALSE): Not complete
0x1 (TRUE): Command execution is completed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_COMPLETE</name>
              <description>Command Complete
In an SD/eMMC Mode, this bit is set when the end bit of a response except for Auto CMD12 and Auto CMD23.
This interrupt is not generated when the Response Interrupt Disable in Transfer Mode Register is set to 1.
Values:
0x0 (FALSE): No command complete
0x1 (TRUE): Command Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
