hpmicro/hpm_sdk/soc/HPM6700/HPM64A0/HPM64A0_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PLLCTL</name>
      <description>PLLCTL</description>
      <groupName>PLLCTL</groupName>
      <baseAddress>0xf4100000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x300</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>XTAL</name>
          <description>Crystal control and status</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x300FFFFF</resetMask>
          <fields>
            <field>
              <name>RESPONSE</name>
              <description>Crystal oscillator status
0: Oscillator is not stable
1: Oscillator is stable for use</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Crystal oscillator enable status
0: Oscillator is off
1: Oscillator is on</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMP_TIME</name>
              <description>Rampup time of XTAL oscillator in cycles of IRC24M clock
0: 0 cycle
1: 1 cycle
2: 2 cycle
1048575: 1048575 cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x80</dimIncrement>
          <dimIndex>pll0,pll1,pll2,pll3,pll4</dimIndex>
          <name>PLL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x80</addressOffset>
          <register>
            <name>CFG0</name>
            <description>PLLx config0</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00140460</resetValue>
            <resetMask>0xBF77FFE8</resetMask>
            <fields>
              <field>
                <name>SS_RSTPTR</name>
                <description>reset pointer, for sscg, lock when lock_en[31]&amp;~pll_ana_pd&amp;~pll_lock_comb</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REFDIV</name>
                <description>refclk diverder, lock when lock_en[24]&amp;~pll_ana_pd</description>
                <bitOffset>24</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POSTDIV1</name>
                <description>lock when lock_en[20]&amp;~pll_ana_pd</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SS_SPREAD</name>
                <description>lock when lock_en[14]&amp;~pll_ana_pd</description>
                <bitOffset>14</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SS_DIVVAL</name>
                <description>sscg divval, lock when lock_en[8]&amp;~pll_ana_pd</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SS_DOWNSPREAD</name>
                <description>Downspread control
1’b0 –&gt; Center-Spread
1’b1 –&gt; Downspread</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SS_RESET</name>
                <description>No description available</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SS_DISABLE_SSCG</name>
                <description>No description available</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSMPD</name>
                <description>1: int mode;  0: frac mode</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG1</name>
            <description>PLLx config1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x80000000</resetValue>
            <resetMask>0x86008000</resetMask>
            <fields>
              <field>
                <name>PLLCTRL_HW_EN</name>
                <description>1: hardware controll PLL settings, software can update register, but result unknown; suggested only update fbdiv and frac value
0: full software control PLL settings</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLKEN_SW</name>
                <description>the clock enable used to gate pll output, should be set after lock, and clear before power down pll.
pll_clock_enable = pllctrl_hw_en ? (pll_lock_comb &amp; enable &amp; pll_clk_enable_chg) : clken_sw;</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PLLPD_SW</name>
                <description>pll power down.
pll_ana_pd = pllctrl_hw_en ? (pll_pd_soc|pll_pd_chg) : pllpd_sw;
pll_pd_soc is just delay of soc enable, for soc to control pll on/off;
pll_pd_chg is used to power down pll when div_chg_mode is 1, if software update pll parameter(fbdiv or frac), pll_ctrl will power down pll, update parameter, then power up pll. response to soc will not de-asserted at this sequence</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_CNT_CFG</name>
                <description>used to wait lock if set larger than lock time;
default 1500 24M cycle if refdiv is 1, 4500 cycle if refdiv is 3</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG2</name>
            <description>PLLx config2</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000FFF</resetMask>
            <fields>
              <field>
                <name>FBDIV_INT</name>
                <description>fbdiv used in int mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FREQ</name>
            <description>PLLx frac mode frequency adjust</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FRAC</name>
                <description>PLL output frequency is :
Fout = Fref/refdiv*(fbdiv + frac/2^24)/postdiv1
for default refdiv=1 and postdiv1=1, 24MHz refclk
Fout is 24*fbdiv in int mode
if frac is set to 0x800000, Fout is 24*(fbdiv+0.5)
Fout is 24*fbdiv in int mode
if frac is set to 0x200000, Fout is 24*(fbdiv+0.125)</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FBDIV_FRAC</name>
                <description>fbdiv used in frac mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>PLLx lock control</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x81104100</resetMask>
            <fields>
              <field>
                <name>LOCK_SS_RSTPTR</name>
                <description>lock bit of field ss_rstptr
0: field is open foe software to change
1: field is locked, not changeable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_REFDIV</name>
                <description>lock bit of field refdiv
0: field is open foe software to change
1: field is locked, not changeable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_POSTDIV1</name>
                <description>lock bit of field postdiv1
0: field is open foe software to change
1: field is locked, not changeable</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_SS_SPEAD</name>
                <description>lock bit of field ss_spead
0: field is open foe software to change
1: field is locked, not changeable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_SS_DIVVAL</name>
                <description>lock bit of field ss_divval
0: field is open foe software to change
1: field is locked, not changeable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>PLLx status</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x08000007</resetMask>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>enable from SYSCTL block</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RESPONSE</name>
                <description>response to SYSCTL, PLL is power down when both enable and response are 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PLL_LOCK_COMB</name>
                <description>No description available</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PLL_LOCK_SYNC</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIV0</name>
            <description>PLLx divider0 control</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xB00000FF</resetMask>
            <fields>
              <field>
                <name>BUSY</name>
                <description>Busy flag
0: divider is working
1: divider is changing status</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RESPONSE</name>
                <description>Crystal oscillator status
0: Oscillator is not stable
1: Oscillator is stable for use</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Crystal oscillator enable status
0: Oscillator is off
1: Oscillator is on</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIV</name>
                <description>Divider
0: divide by 1
1: divide by2
. . .
255: divide by 256</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIV1</name>
            <description>PLLx divider1 control</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xB00000FF</resetMask>
            <fields>
              <field>
                <name>BUSY</name>
                <description>Busy flag
0: divider is working
1: divider is changing status</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RESPONSE</name>
                <description>Crystal oscillator status
0: Oscillator is not stable
1: Oscillator is stable for use</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Crystal oscillator enable status
0: Oscillator is off
1: Oscillator is on</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIV</name>
                <description>Divider
0: divide by 1
1: divide by2
. . .
255: divide by 256</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
